{"reviews":["This movie was so AWESOME! I loved it all and i had a bad day before watching it but it turned it around. I love action packed movies and this was great.","Really funny and with great spcial effects. Probably, one of the movies not to miss this year.","I ΛM GЯӨӨƬ!","This was a pleasant surprise of a movie, full of great humor as well as an intriguing story.  It's quick and zany at times.  Think <em>Psych<\/em> in space (back when Psych was funny).  The pace is quick and the story line is easy to pick up and follow.\r\n\r\nWhat makes the film work is something that early Lucas and Joss Whedon understand:  great sci-fi movies are really westerns at heart.  There is a relationship with nature, a broken, compromised hero, a deep necessity for teamwork, and the story happens OUT there in the wild.  <em>Guardians of the Galaxy<\/em> has ALL of this.  \r\n\r\n<em>Guardians<\/em> is already set up for a sequel so we will see if Marvel can continue the magic.  It's a great addition to the Marvel universe.","Like most of the reviews here, I agree that Guardians of the Galaxy was an absolute hoot. Guardians never takes itself too seriously which makes this movie a whole lot of fun.\r\n\r\nThe cast was perfectly chosen and even though two of the main five were CG, knowing who voiced and acted alongside them completely filled out these characters.\r\n\r\nGuardians of the Galaxy is one of those rare complete audience pleasers. Good fun for everyone!","The thing about this film when I first saw it, was the incredible juxtaposition of sadness, humor and courage. Great acting! The music is superb. That Sony Walkman must be the best bit of brand advertising ever engaged by a company within a film. The film should appeal to a broad range of viewers.","This movie is more of a comedy than anything else. It is truly a comic magazine brought to life on the big screen and more focused on delivering a sequence of action scenes and laughs than anything intelligent in the form of plot or characters. I would say it is a movie for the younger audience and comic fans. Having said that I must admit that I found it rather fun to watch.\r\n\r\nThe main characters are two mostly irresponsible rascals, one dumb but likable living tree and two fanatics of which one certainly need not apply to the Mensa club. Of the five I liked Rocket and Gamora the best. Rocket is a rather likable rascal and Gamora is simply cool. Quill is sometimes just silly, Groot is more of a living prop and Drax is just too stupid.\r\n\r\nThe story is more or less just there to tie the scenes together. Unfortunately we do really not get much of a background to the Guardians of The Galaxy universe. It would have been nice to get a bit more understanding of why things are as they are etc. The return of this movie is watching the action, the special effects and the laughs. It is an action-adventure-comedy plain and simple. If you approach it as such it works reasonably well.\r\n\r\nSpeaking of special effects, they are generally well done. The designs are interesting. The shape of the bad guys spaceship is totally ludicrous of course but visually pleasing and goes with the rest of the movie’s tendency to be more of a comedy than a serious movie. The same can be said for that cool but weird net they made by interlinking fighter crafts.\r\n\r\nOn the whole an entertaining movie. I have to say that the dancing scene at the end was a wee bit too silly for me though. I have a problem understanding how a movie like this can get such a relatively high rating at IMDb but okay it was fun to watch and it is not entirely undeserved. Personally I think a 7 out of 10 is more in the right region.\r\n\r\nSHARE THIS:","**A long form review originally posted n 2014:**\r\n\r\nNow that I’ve given _Guardians_ a BluRay watch through, I feel more comfortable reviewing it. I saw it on the first day of its Australian cinematic release, but I wasn’t sure what I thought. I watched it again and still wasn’t sure, but now that it’s six months later, I am sure.\r\n\r\nI’m a massive fan of director James Gunn. Come to think of it, I’m also also a big fan of Lee Pace, Michael Rooker, Chris Pratt, Benicio Del Toro, Djimon Honsou, Bradley Cooper, Vin Diesel, Peter Serafinowicz, Alexis Denisof, Rob Zombie and Nathan Fillion, and they’re all in this. Not to mention I’m an absolute sucker for the MCU. So after hearing that a very decent chunk of the fanbase thinking that not only was this the best Marvel film of the year (going up against _Winter Soldier_ and _Days of Future Past_), but that they would then go on to say it was the best Marvel Cinematic Universe film ever, you could imagine I was very surprised to find that I actually didn’t think it was all that great.\r\n\r\nI don’t want people thinking I didn’t like it. I did. In fact I will go on record saying that it was miles away from their worst film, and if I’m being honest they handled the last 25 minutes (arguably the most important part) of the film absolutely spectacularly. But I didn’t get the magic that everyone was telling me about. How this was the film for the new generation.  I didn’t even get the sense of satisfaction that I had in Cap’s movie just a few months previous.\r\n\r\nSo many things seemed under utilised, but I don’t know what you could have cut to make room for the extra things I wanted. Which means the only way to get it is to have a longer film. It’s already two hours, and a longer movie means a bigger budget and less screenings. ie. more money going out and less money coming in. And at the end of the day Disney is a business, and they have to make their money the best way they think they can. So I understand why it wasn’t perfect for me, but that doesn’t stop me from feeling _Guardians_ is a mite overrated. Good damn movie. But overrated.\r\n\r\nPersonally I’d stick it somewhere in the middle of the MCU’s releases thus far. Leaps and bounds above _The Incredible Hulk_, _The Dark World_ and _Iron Man 2_, but not so beloved as the likes of _The Avengers_, _Winter Soldier_ or _Iron Man 1_.\r\n\r\n73%\r\n\r\n-_Gimly_"]}