{"reviews":["\"It carries the burden of being about odds and stakes, of legacies and consequences, of understanding destiny...\"\r\n\r\nRead the full review here: http:\/\/screen-space.squarespace.com\/reviews\/2016\/12\/17\/rogue-one-a-star-wars-story.html","Is not my new favourite _Star Wars_ movie. But does contain my new favourite _Star Wars_ scene.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._","Fun Star Wars movie. Plenty of homages and nods to the original trilogy throughout the film, Andy plenty of cameos as well. Has amazing action sequences and enough thrills to keep any true Star Wars fan hooked right from the beginning. No opening crawl at the start for a change and a great score by Michael Giachinno, but still includes the original end credits with John Williams' original music. K-2SO is a show stealer and is very funny as a character. Overall the best Star Wars film since Empire Strikes Back in my opinion. The force is with this one.","On the surface, this is a well-made action movie set within the Star Wars universe filled with nods and homages to \"A New Hope\" that will make you tingle with warm nostalgia. The reappearance of sets, costumes and characters from our favorite childhood movies might make you say \"Now, THIS is a Star Wars movie!\"\r\n\r\nHowever, nostalgia and making copious amounts of money on that nostalgia seemed to be Disney's primary strategy with this movie. It's mimicry, plain and simple. The CGI recreations of Peter Cushing and Carrie Fisher felt very dirty and a flagrant disrespect to the departed actors, not to mention jarring, for a first time viewer. The digital appearance of Grand Moff Tarkin disengaged me from the frail story and made me settle my stomach with a handful of antacid tablets. \r\n\r\nThe story, writing, characterization is on-par with what you'd expect from modern cinema and the movie serves it's primary purpose of being entertaining. But, as a long-time Star Wars fan, I just couldn't help but feeling pandered to while watching this movie.","Oups! I just realized that, for some reason, this movie had fallen between the cracks. It was quite some time since I watched it but I seem to have forgotten to write a post about it.\r\n\r\nFor me this was one of the best of the new (after the original trilogy) Star Wars movies. It was fun, entertaining with plenty of good, old-fashioned Star Wars action. I generally do not like prequels but this time I felt it was nice to get a bit of the background to the statement that “a number of spies died to get this information” in episode IV. We were even provided with a bit of an explanation as to why the Death Star had this silly weakness in the first place.\r\n\r\nThe actors were doing a decent enough job of it. The chatty android was fun without being totally silly. It was a nice roller coaster ride of action, improvisations, and gung ho ludicrous stunts inside and outside of various forms of transportation means.\r\n\r\nAs usual with Star Wars the science part of science fiction is somewhat lacking. What looks cool is what is put on the screen and screw science. When reading books I am more sensitive to such things but for a Star Wars movie it works well enough.\r\n\r\nSome people seem to be dissecting the characters and dialogue, trying to put logic into it as well as wanting to have more emotions and “character development”. Come on! It is a Star Wars movie. It is supposed to be all action and visually stunning.\r\n\r\nOn that this movie delivers. Sure the plot is not really the most developed one and has plenty of faults. The movie is till a hugely fun Star Wars based science romp though.","**The episode III½.**\r\n\r\nSo this is like a bridge between the original trilogy and the next three prequels. A story where the main characters from the original tale are not involved. Being a big fan of this franchise, I loved it. I did not expect big, so got entertained well. But pity that this wonderful characters are not going to return. This is just a one-off film. For seeing its overwhelming success, there could be a prequel, which has a very very slim chance.\r\n\r\nThe story was like that had started in a half way. That's why I wanted a prequel to tell us the Galen Erso's point of view story. When he has been taken back to the base to work for the Empire, his daughter is the only one who escapes from there. After a few years later the grown- up daughter, Jyn, end up on the rebel's side. When she hints a plan for them to strike the Empire, nobody considers it. But a rogue gang forms where they all does according to her saying. That's the story, and how it all ends are the rest.\r\n\r\nThe story was simple, but the action-adventures were good. Like what a 'Star Wars' fans want to see. The main drawback was there's no familiar faces around. Even the original franchise style of title and credit presentation was off the beat. Though there were cameos. Darth Vade, Princess Leia, R2D2 and 3PO, including a small lightsabre fight at the end, just to satisfy the fanboys. Overall a worthy film, otherwise it would have not earned one billion at the box office, making one of the top 10 of all time.\r\n\r\n_8\/10_"]}