{"reviews":["There is a lot going on in this movie but it all just seemed kind of pointless and dull to me. Every now and then there would be a good scene or piece of dialogue but for the most part I felt myself getting bored and reaching for my phone to play Cribbage. I guess what I didn't like most is that it all felt like a big filler episode instead of an action packed character driven story arc.","Action, good Fx and a \"not-completely-absurd\" story. The actors perform well and you can identify them very well with their characters ... but it is all old and without imagination.\r\n\r\nI suppose nobody was expecting anything else, though ...","This is another one of those movies that you watch primarily for the special effects with you favourite super heroes slugging it out. It is a classical Hollywood product where the story is mostly there just as a vehicle for allowing the special effects team to do their business. As such it is a success.\r\n\r\nThe movie starts of with a display of action and the afore mentioned special effects with an attack by the Avengers on a bad guy stronghold. Not surprisingly the events sows the seeds for things to come.\r\n\r\nThe movie starts off with quite an interesting story idea with the activation of Ultron. However, once he materializes as a physical entity, it became a bit of seen that, been there and done that. Ultron just turns into yet another “standard” comic book villain a’ la Megatron running around trying to look intimidating while implementing his diabolical scheme. Okay, there was a bit of originality here and there but with the good start I kind of expected a wee bit more.\r\n\r\nHaving said that, the movie does indeed fulfil its purpose of showing off a bunch of super heroes slugging it out in a flurry of special effects and, although the story idea was perhaps not used as intelligently as I had hoped, it is not bad (for this kind of movie of course) and hangs together pretty okay. Sure, it is somewhat contrived and the means by which Ultron tries to exterminate humanity is overly complicated but it is still a decent story.\r\n\r\nOverall the movie was entertaining and provided the necessary special effects and super hero fix for those who are inclined to enjoy those kind of movies. I certainly am and, not surprisingly, the kids liked it as well.","**A long form review originally posted in 2015:**\r\n\r\nI’ve just returned from two back-to-back viewings of _Avengers: Age of Ultron_, and I do not regret one bit going in for that second helping.\r\n\r\nI lost my steam on the _Age of Ultron_ wagon at a very inopportune moment. About three days before it came out. I was so heavily anticipating it for such a long time, that I was actually much more excited to see this movie when it was still two months away than I was waiting in line to get into the cinema it was playing at. The combination of the market-saturation and the fact that the _Ultron _hype-train has been running for literally years, with a first trailer dropping seven months before the damn thing came out, meant I got weary of the thing just a fraction too soon. But I’m a sucker for the MCU, and there was no way I was missing the sequel to my favourite superhero movie of all time.\r\n\r\nI won’t harp on too much, because I don’t want to spoil anything (especially given that the movie isn’t even out in most parts of the world), I will put out a spoilertalk on this blog at some point down the line, but for now just let me leave you with a couple of quick thoughts.\r\n\r\n_Age of Ultron_ is not the best film of all time. It’s not the best superhero film of all time, it’s not even the best MCU film. Honestly, I personally feel it’s not even the best MCU Phase 2 film. But it is still good. And that’s what’s important here. But what do I mean by that? \r\n\r\nWell, for starters, in and of itself, I loved it, a breach past an 80% approval rating from me is no small thing. The things we enjoyed from the first _Avengers_are here. The mesmerising action spectacles of course, but I more mean the character moments we got between the Avengers themselves, that was my favourite part of the first film and we get it here again in spades. \r\n\r\nEvery new thing Joss has added to the plate works splendidly as well, real Hawkeye story, new heroes, a new villain, an updated world, all of these things are big ticks in lots of boxes.\r\n\r\nSo if everything from _The Avengers_ works and everything they’ve added works great too, why is _Age of Ultron_ not a perfect film? For spoiler-free purposes I will not go into detail, but that’s okay because the answer is quite simple: Everything in _Age of Ultron_ is great. It’s what’s not in _Age of Ultron_ that’s the problem.\r\n\r\nJoss Whedon said that the film had to be cut by nearly an hour. That way you get more showings in, and that means more money. Now I’m not saying we need every minute of that hour back, but what we ended up being left with, was just enough for _Age of Ultron_ to be the _Thor: The Dark World_ of the _Avengers _franchise (it was a far superior film to _Dark World_, but hear me out). _Age of Ultron_ is little more than a holding pattern. The set-ups for future films take up too much time for the story to bear the weight of some actual story, but everything that occurs in the film itself somehow also has virtually no consequence on world it is a part of. I can’t say it more plainly than that: It’s a holding pattern. It introduces some stuff, but it doesn’t stand alone the first film did. It’s not such a big deal when the solo-movies do that (like the aforementioned _Dark World_) because we have _The Avengers_ films for those to pay off in. But when an _Avengers_ entry is just more of the same, I can’t fully get behind it.\r\n\r\nThat all said, _Age of Ultron_ is of course a lot of fun. A huge amount of fun, I can’t state that enough. And there’s literally nothing more important something in the entertainment industry can be. These are just the things holding it back from taking it up to the next level (or if I’m being completely honest, even taking it to the level the first film was at).\r\n\r\n75%\r\n\r\n-_Gimly_"]}